            /*Перемикач для типу доставки*/
            $(document).ready(function () {
            $('.delivery-method').change(function () {
                if ($(this).val() === 'Доставка Новою Поштою') {
                    $('.delivery-details').removeClass('d-none');
                }
                else {
                    $('.delivery-details').addClass('d-none');
                    $('#regionSelect').val("");
                    $('#citySelect').val("");
                    $('#officeSelect').val("");
                    $('#regionSelect').innerHTML("");
                    $('#citySelect').innerHTML("");
                    $('#officeSelect').innerHTML("");
                }
            }).trigger('change'); 
            });
            /////////////////////////////

            //Перемикач для областей та міст
            var citiesByRegion = {
            "--Оберіть область--": ["--Оберіть місто--"],
            "Вінницька область": ["Бар", "Вінниця", "Жмеринка", "Крижопіль", "Могилів-Подільський", "Хмільник"],
            "Волинська область": ["Володимир-Волинський", "Ковель", "Луцьк", "Нововолинськ"],
            "Дніпропетровська область": ["Дніпро", "Жовті Води", "Кам'янське", "Кривий Ріг", "Нікополь"],
            "Донецька область": ["Авдіївка", "Волноваха", "Донецьк", "Дружківка", "Маріуполь"],
            "Житомирська область": ["Бердичів", "Житомир", "Коростень", "Новоград-Волинський"],
            "Закарпатська область": ["Берегово", "Мукачево", "Ужгород", "Хуст"],
            "Запорізька область": ["Бердянськ", "Запоріжжя", "Кам'янка-Дніпровська", "Мелітополь"],
            "Івано-Франківська область": ["Івано-Франківськ", "Калуш", "Коломия", "Хуст"],
            "Київ": ["Київ"],
            "Київська область": ["Біла Церква", "Бровари", "Ірпінь", "Українка"],
            "Кіровоградська область": ["Кропивницький", "Олександрія", "Світловодськ", "Устинівка"],
            "Луганська область": ["Алчевськ", "Лисичанськ", "Луганськ", "Рубіжне", "Сєвєродонецьк"],
            "Львівська область": ["Дрогобич", "Львів", "Самбір", "Трускавець"],
            "Миколаївська область": ["Миколаїв", "Нова Одеса", "Первомайськ", "Южноукраїнськ"],
            "Одеська область": ["Ізмаїл", "Одеса", "Подільськ", "Южне", "Березівка"],
            "Полтавська область": ["Гадяч", "Глобине", "Гребінка", "Зіньків", "Карлівка", "Кременчук", "Лохвиця", "Миргород", "Пирятин", "Полтава"],
            "Рівненська область": ["Рівне", "Дубно", "Вараш", "Здолбунів", "Кузнецовськ", "Костопіль"],
            "Сумська область": ["Конотоп", "Ромни", "Суми", "Шостка"],
            "Тернопільська область": ["Бережани", "Борщів", "Теребовля", "Тернопіль"],
            "Харківська область": ["Ізюм", "Куп'янськ", "Лозова", "Харків"],
            "Херсонська область": ["Херсон", "Нова Каховка", "Каховка", "Генічеськ", "Скадовськ"],
            "Хмельницька область": ["Волочиськ", "Городок", "Деражня", "Дунаївці", "Кам'янець-Подільський", "Красилів", "Нетішин", "Полонне", "Славута", "Старокостянтинів", "Хмельницький"],
            "Черкаська область": ["Канів", "Сміла", "Умань", "Черкаси"],
            "Чернівецька область": ["Вижниця", "Новоселиця", "Сторожинець", "Чернівці"],
            "Чернігівська область": ["Ніжин", "Прилуки", "Чернігів"]
        };

        var regionSelect = document.getElementById("regionSelect");
        var citySelect = document.getElementById("citySelect");

        regionSelect.addEventListener("change", function () {
            var selectedRegion = regionSelect.value;
            var cities = citiesByRegion[selectedRegion];

            citySelect.innerHTML = "";

            for (var i = 0; i < cities.length; i++) {
                var option = document.createElement("option");
                option.text = cities[i];
                option.value = cities[i];
                citySelect.add(option);
            }
        });

        /////////////////////////////////////////////
        //Перемикач для областей та міст
            var officesByCities = {
            "--Оберіть місто--": ["--Оберіть відділення--"],
            "Вінниця": ["Нова Пошта - Відділення №1, вул. Миру, 25", " Нова Пошта - Відділення №2, вул. Європейська, 34"],
            "Дніпро": ["Нова Пошта - Відділення №1, пр. Дмитра Яворницького, 117", "Нова Пошта - Відділення №2, вул. Січеславська Набережна, 29"],
            "Донецьк": ["Нова Пошта - Відділення №1, пр. Панфілова, 4", "Нова Пошта - Відділення №2, вул. Артема, 80"],
            "Житомир": ["Нова Пошта - Відділення №1, вул. Київська, 77", " Нова Пошта - Відділення №2, вул. Соборна, 15"],
            "Запоріжжя": ["Нова Пошта - Відділення №1, вул. Соборна, 154", "Нова Пошта - Відділення №2, вул. Шевченка, 97"],
            "Івано-Франківськ": ["Нова Пошта - Відділення №1, вул. Шевченка, 30", "Нова Пошта - Відділення №2, вул. Мазепи, 24"],
            "Київ": ["Нова Пошта - Відділення №1, вул. Хрещатик, 15", "Нова Пошта - Відділення №2, вул. Володимирська, 49"],
            "Кропивницький": ["Нова Пошта - Відділення №1, вул. Першотравнева, 13", "Нова Пошта - Відділення №2, вул. Київська, 61"],
            "Луганськ": ["Нова Пошта - Відділення №1, вул. Героїв Маріуполя, 30", "Нова Пошта - Відділення №2, вул. Віденська, 93"],
            "Львів": ["Нова Пошта - Відділення №1, вул. Городоцька, 174", "Нова Пошта - Відділення №2, вул. Коперника, 38"],
            "Миколаїв": ["Нова Пошта - Відділення №1, вул. Соборна, 60", "Нова Пошта - Відділення №2, вул. Декабристів, 20"],
            "Одеса": ["Нова Пошта - Відділення №1, вул. Дерибасівська, 27", "Нова Пошта - Відділення №2, вул. Ланжеронівська, 21"],
            "Полтава": ["Нова Пошта - Відділення №1, вул. Металістів, 16", "Нова Пошта - Відділення №2, вул. Світла, 87"],
            "Рівне": ["Нова Пошта - Відділення №1, вул. Соборна, 18", "Нова Пошта - Відділення №2, вул. Князя Острозького, 26"],
            "Суми": ["Нова Пошта - Відділення №1, вул. Червона, 25", "Нова Пошта - Відділення №2 вул. Івана Огієнка 26"]
        };

        var citySelect = document.getElementById("citySelect");
        var officeSelect = document.getElementById("officeSelect");


        citySelect.addEventListener("change", function () {
            var selectedCity = citySelect.value;
            var offices = officesByCities[selectedCity];

            officeSelect.innerHTML = "";
            for (var i = 0; i < offices.length; i++)
            {
            var option = document.createElement("option");
                option.text = offices[i];
                option.value = offices[i];
                officeSelect.add(option);
            }
        });        
        